InformationRegisters/ПодключениеКомбинированныхПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПодключениеКомбинированныхПриложений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусКомбинированногоПриложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусКомбинированногоПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусКомбинированногоПриложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрированоОбновление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрированоУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользовалось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ПодключениеКомбинированныхПриложений/Forms/СтатусПриложений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ВозможностиПриложения.ЭтоБизнесПриложение() Тогда
		Элементы.ГруппаПредупреждение.Видимость = Истина;
		Доступность = Ложь;
	Иначе
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
	КонецЕсли;

	Если ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Элементы.СтатусПриложенийЗапуститьРегламентноеЗадание.Видимость = Истина;
	КонецЕсли;
	
	Элементы.Список.ТолькоПросмотр = Истина;
	ЗаполнитьСтатусыПриложений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	Элементы.Список.ТолькоПросмотр = Ложь;
	Элементы.СписокВключитьВозможностьРедактирования.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьПриложение(Команда)
	
	Если Элементы.СтатусПриложений.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПриложения = Элементы.СтатусПриложений.ТекущиеДанные.ИмяПриложения;
	ПодключитьПриложениеНаСервере(ИмяПриложения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьПриложение(Команда)
	
	Если Элементы.СтатусПриложений.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПриложения = Элементы.СтатусПриложений.ТекущиеДанные.ИмяПриложения;
	ОтключитьПриложениеНаСервере(ИмяПриложения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбновлениеПриложений(Команда)
	ВыполнитьОбновлениеПриложенийНаСервере();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРегламентноеЗадание(Команда)
	ЗапуститьРегламентноеЗаданиеНаСервере(); 
	Обновить("");	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодключитьПриложениеНаСервере(ИмяПриложения)
	
	РегистрыСведений.ПодключениеКомбинированныхПриложений.ЗарегистрироватьСобытие(ИмяПриложения, Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоОбновление);
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьПриложениеНаСервере(ИмяПриложения)
	
	РегистрыСведений.ПодключениеКомбинированныхПриложений.ЗарегистрироватьСобытие(ИмяПриложения, Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоУдаление);
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	Элементы.Список.Обновить();
	ЗаполнитьСтатусыПриложений();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыПриложений()
	
	СтатусПриложений.Очистить();
	ПолученоСтатусПриложений = РегистрыСведений.ПодключениеКомбинированныхПриложений.СтатусПриложений();
	Для каждого Строка Из ПолученоСтатусПриложений Цикл
		НоваяСтрока = СтатусПриложений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Если НоваяСтрока.Статус = Перечисления.СтатусКомбинированногоПриложения.Подключено Тогда
			НоваяСтрока.ПоказатьКартинкаПриложениеПодключено = Истина;
		ИначеЕсли НоваяСтрока.Статус = Перечисления.СтатусКомбинированногоПриложения.Отключено Тогда
			НоваяСтрока.ПоказатьКартинкаПриложениеОтключено = Истина;
		ИначеЕсли НоваяСтрока.Статус = Перечисления.СтатусКомбинированногоПриложения.НеИспользовалось Тогда
			НоваяСтрока.ПоказатьКартинкаПриложениеНеиспользовалось = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбновлениеПриложенийНаСервере()
	
	ПриложенияДляОтключения = РегистрыСведений.ПодключениеКомбинированныхПриложений.ПриложенияДляОтключения();
	Для каждого ОписаниеПриложения Из ПриложенияДляОтключения Цикл
		ОписаниеСобытия = НСтр("ru='Пользователь инициировал отключение приложения ""%1"".'");
		ОписаниеСобытия = СтрШаблон(ОписаниеСобытия, ОписаниеПриложения.Имя);
		ТарификацияБизнес.ОбработатьОтключениеПриложения(ОписаниеПриложения, ОписаниеСобытия, Ложь);
	КонецЦикла;
	
	ПриложенияДляПодключения = РегистрыСведений.ПодключениеКомбинированныхПриложений.ПриложенияДляПодключения();
	Для каждого ОписаниеПриложения Из ПриложенияДляПодключения Цикл
		ПриложениеМожетБытьПодключено = ТарификацияБизнес.ПриложениеМожетБытьПодключено(ОписаниеПриложения);
		Если ПриложениеМожетБытьПодключено.Результат Тогда
			ОписаниеСобытия = НСтр("ru='Пользователь инициировал подключение приложения ""%1"".'");
			ОписаниеСобытия = СтрШаблон(ОписаниеСобытия, ОписаниеПриложения.Имя);
			ТарификацияБизнес.ОбработатьПодключениеПриложения(ОписаниеПриложения, ОписаниеСобытия, Ложь);
		Иначе
			ТекстОшибки = НСтр("ru='Приложение ""%1"" не может быть подключено по причине: %2'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, ОписаниеПриложения.Имя, ПриложениеМожетБытьПодключено.Причина);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьРегламентноеЗаданиеНаСервере()
    ТарификацияБизнес.АктуализироватьСостояниеПодписок();
КонецПроцедуры

#КонецОбласти
